html/theory/halting_problem.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>停机问题</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">停机问题</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org904b447">非正式证明</a></li>
<li><a href="#org64b58b2">哥德尔不完备定律</a>
<ul>
<li><a href="#orgc008120">从哥德尔公式到 Y 组合子</a></li>
</ul>
</li>
<li><a href="#org3190152">对角线方法</a></li>
</ul>
</div>
</div>
<pre class="example">
停机问题：给定一个只需要一个输入的程序 P，以及一个对象 x，判断程序 P 在以 x 作为输入时是否会停机

能否用代码实现一个函数 S ，它的参数是 P 和 x ：
1. 如果P(x) 停机，则 S 返回 true
2. 如果P(x) 死循环，则 S 返回 false 
</pre>

<div id="outline-container-org904b447" class="outline-2">
<h2 id="org904b447">非正式证明</h2>
<div class="outline-text-2" id="text-org904b447">
<p>
假设可以编写一个过程 stop? ，如果 P(x) 能停机 ，则 stop? 返回 #t , 否则返回 #f 
</p>

<pre class="example">
(define (stop? P x)
  ....) 
</pre>

<p>
死循环定义为：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">loop-forever</span> x<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span>loop-forever x<span style="color: #696969;">))</span> 
</pre>
</div>

<p>
显然有：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span>stop? loop-forever 1<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; #f </span>
</pre>
</div>

<p>
现在定义一个辅助过程 diag ：
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">diag</span> x<span style="color: #696969;">)</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>stop? x x<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span>loop-forever<span style="color: #696969;">)</span>
        42<span style="color: #696969;">))</span>
</pre>
</div>

<p>
接下来的问题就是：  <b>(diag diag)</b> 的值是多少？ 
</p>
<ul class="org-ul">
<li>如果(diag diag) 触发死循环 ，意味着 (stop? diag diag)为 true ，根据 stop? 的定义，推理得 diag(diag) 应该停机，这和 (diag diag) 产生死循环相悖</li>
<li>如果(diag diag) 返回 42 ，意味着 (stop? diag diag) 为 false ，根据 stop? 的定义，可以得到 diag(diag) 不会停机，这个 (diag diag) 返回 42 相悖</li>
</ul>

<p>
根据上面的分析，可以推理出： <b>过程 <span class="underline">stop?</span> 可以被编写</b>  这个假设是 <b>错误的</b> 
</p>

<pre class="example">
  停机问题是一个不可被计算的函数，这意味着存在一个函数，可以被定义，但是无法被编程
</pre>
</div>
</div>

<div id="outline-container-org64b58b2" class="outline-2">
<h2 id="org64b58b2">哥德尔不完备定律</h2>
<div class="outline-text-2" id="text-org64b58b2">
<p>
把思绪回到1931年，那个数学界风起云涌的年代，一个名不经传的20出头的学生，在他的博士论文中证明了一个惊天动地的结论
</p>
<pre class="example">
  在那个年代，希尔伯特的数学天才就像太阳的光芒一般夺目，在关于数学严格化的大纷争中希尔伯特带领的形式主义派系技压群雄，得到许多当时有名望的数学家的支持

  希尔伯特希望借助于 形式化 的手段，抽掉数学证明中的意义
  把数学证明抽象成一堆无意义的符号转换，就连人类赖以自豪的逻辑推导，也不过只是一堆堆符号转换而已

  这样一来，一个日常所谓的，带有直观意义和解释的数学系统就变成了一个纯粹由无意义符号表达的、公理加上推导规则所构成的形式系统
  而数学证明呢，只不过是在这个系统内玩的一个文字游戏

  令人惊讶的是，这样一种做法，真的是可行的！数学的意义，似乎竟然真的可以被抽掉！
  另一方面，一个形式系统具有非常好的性质，平时人们证明一个定理所动用的推导，变成了纯粹机械的符号变换

  希尔伯特希望能够证明，在任一个无矛盾的形式系统中所能表达的所有陈述都要么能够证明要么能够证伪
  这看起来是个非常直观的结论，因为一个结论要么是真要么是假
  而它在它所处的领域/系统中当然应该能够证明或证伪了（只要我们能够揭示出该系统中足够多的真理）
</pre>

<p>
然而，哥德尔的证明无情的击碎了这一企图，哥德尔的证明揭示出， <b>任何足够强到蕴含了皮亚诺算术系统（PA）的一致（即无矛盾）的系统都是不完备的</b> ，所谓不完备也就是说在 <b>系统内存在一个为真但无法在系统内推导出的命题</b> 。这在当时的数学界揭起了轩然大波，其证明不仅具有数学意义，而且蕴含了深刻的哲学意义。从那时起这一不完备性定理就被引申到自然科学乃至人文科学的各个角落…至今还没有任何一个数学定理居然能够产生这么广泛而深远的影响
</p>

<p>
哥德尔的证明非常的长，达到了200多页纸，但其中很大的成分是用在了一些辅助性的工作上面，比如占据超过1/3纸张的是关于一个形式系统如何映射到自然数，也就是说，如何 <span class="underline">把一个形式系统中的所有公式都表示为自然数</span> ，并可以 <span class="underline">从一自然数反过来得出相应的公式</span> 。这其实就是 <b>编码</b> ，现在看来是很显然的：
</p>
<ul class="org-ul">
<li>因为一个程序就可以被编码成 <span class="underline">二进制数</span> ，反过来也可以 <span class="underline">解码</span> 。但是在当时这是一个全新的思想，也是最关键的辅助性工作之一</li>
<li>这正是 <b>程序即数据</b> 的最初想法</li>
</ul>

<p>
现在要证明哥德尔的不完备性定理，只需在假定的 <span class="underline">形式系统 T</span> 内表达出一个为 <span class="underline">真</span> 但无法在 <span class="underline">T</span> 内 <b>推导</b> 出（证明）的 <span class="underline">命题</span> 。于是哥德尔构造了这样一个命题 P :  <b>T 系统内无法证明 P</b> ，这里的系统 T 当然就是命题 P 所处的形式系统
</p>

<pre class="example">
  哥德尔构造的命题其实就是 “我不可以被证明”，跟著名的说谎者悖论非常相似，只是把“说谎”改成了“不可以被证明”
</pre>

<p>
如果这个命题能够在 T 内表达出来，就可以得出 <span class="underline">P为真但无法在T内推导出来</span> 的结论，从而证明 T 的不完备性 ：
</p>
<ol class="org-ol">
<li>假设 <span class="underline">T 可以证明出 P</span> ，而因为 P 说的就是 <span class="underline">P不可在系统T内证明</span> ，于是又得到 <b>T 无法证明出P</b> ，产生矛盾</li>
<li>这说明假设 <span class="underline">T可以证明P</span> 是错误的，根据排中律，得到 <span class="underline">T不可以证明P</span></li>
<li>由于P说的正是“T系统内无法证明P”，所以 P 就成了一个 <b>正确的命题，同时无法由T内证明</b> ！</li>
</ol>

<pre class="example">
  如果你足够敏锐，你会发现上面这番推理本身不就是证明吗？其证明的结果不就是 P 是正确的？

  然而实际上这番证明是位于 T 系统之外的，它用到了一个关于T系统的假设“T是一致（无矛盾）的”

  这个假设并非T系统里面的内容，所以刚才其实是在T系统之外推导出了P是正确的

  这跟 P 不能在 T 之内推导出来并不矛盾。所以别担心，一切都正常
</pre>

<p>
那么，剩下来最关键的问题就是 <b>如何用形式语言在T内表达出这个P</b> ，上面的理论虽然漂亮，但如果 P 根本没法在 T 内表达出来，又如何能证明 <span class="underline">T 内存在这个为真但无法被证明的 P</span> 呢？
</p>

<p>
于是，就有了哥德尔证明里面最核心的构造，哥德尔构造了这样一个公式：
</p>
<pre class="example">
N(n) is unprovable in T
</pre>

<p>
这个公式由两部分构成：
</p>
<ul class="org-ul">
<li><span class="underline">n</span> : 这个公式的自由变量，它是一个 <b>自然数</b> ，一旦给定，那么这个 <b>公式就变成一个明确的命题</b></li>
<li><span class="underline">N</span> : 从 <span class="underline">n</span>  <b>解码</b> 出的货真价实的（常见的符号形式的） <span class="underline">公式</span>  
<ul class="org-ul">
<li>哥德尔的证明第一部分就是把公式编码</li>
</ul></li>
<li><span class="underline">is unprovable in T</span> ：一个谓词，这里没有用 <span class="underline">形式语言</span> 而是用 <b>自然语言</b> 表达出来的
<ul class="org-ul">
<li>哥德尔证明了它是可以用形式语言表达出来的，大致思路就是：一个形式系统中的符号数目是有限的，它们构成这个形式系统的符号表</li>
<li>可以依次枚举出所有长度为1的串，长度为2的串，长度为3的串…</li>
<li>根据 <span class="underline">形式系统</span> 给出的 <b>语法规则</b> ，可以检查每个串是否是 <b>良构</b> 的公式，其实也就是说，是否符合语法规则
<ul class="org-ul">
<li>一个形式系统是需要语法规则的，比如逻辑语言形式化之后就会看到 <span class="underline">P-&gt;Q</span> 是良构，而 <span class="underline">-&gt;PQ</span> 则不是</li>
<li>因而可以 <b>枚举出所有的良构的公式来</b></li>
</ul></li>
<li>观察到 <span class="underline">形式系统中的证明</span> 也不过就是由一个个的 <span class="underline">良构公式构成的序列</span> 
<ul class="org-ul">
<li>推导的过程，不就是一个公式接一个公式嘛，而良构公式构成的序列本身同样也是由 <span class="underline">符号表内的符号构成的串</span></li>
<li>所以只需枚举所有的串，对每一个串检查它是否是一个由良构公司构成的序列（证明）：
<ul class="org-ul">
<li>如果是，则记录下这个良构公式序列（证明）的最后一个良构公式，也就是它的 <span class="underline">结论</span> 。这样便枚举出了 <b>所有的可由 T 推导出的定理</b></li>
</ul></li>
</ul></li>
<li>为了表达出 <span class="underline">X is unprovable in T</span> ，本质上只需说 <b>不存在这样一个自然数 S，它所解码出来的良构序列以 X 为终结</b> ！</li>
</ul></li>
</ul>

<p>
现在用 <b>UnPr(X)</b> 来表达 <span class="underline">X is unprovable in T</span> ，于是哥德尔的公式变成了：
</p>
<pre class="example">
UnPr( N(n) )
</pre>

<p>
现在，到了最关键的部分，首先把这个 <span class="underline">公式</span> 简记为 <b>G(n)</b> ：
</p>
<pre class="example">
G(n) : UnPr( N(n) )

但别忘了 G 内有一个自由变量 n，所以G现在还不是一个命题，而只是一个公式，所以谈不上真假
</pre>

<p>
由于 G 也是个 <span class="underline">良构的公式</span> ，所以它也有自己的 <span class="underline">编码 g</span> ，当然 g 是一个自然数，现在我们把 <b>g 作为 G 的参数</b> ，也就是说， <b>把 G 里面的自由变量 n替换为 g</b> ，于是得到一个真正的 <b>命题</b> ：
</p>
<pre class="example">
G(g) : UnPr( G(g) )
</pre>

<p>
用自然语言来说，这个命题 <span class="underline">G(g)</span> 说的就是 <b>我是不可在T内证明的</b> 。而一开始已经讲过了如何用这个命题来推断出 <b>G(g) 为真但无法在 T 内证明</b> ，于是这就证明了 <span class="underline">哥德尔的不完备性定理</span> 
</p>

<pre class="example">
  哥德尔的不完备性定理被称为20世纪数学最重大的发现

  现在知道为真但无法在系统内证明的命题不仅仅是这个诡异的“哥德尔命题”，还有很多真正有意义的明确命题
  其中最著名的就是连续统假设，此外哥德巴赫猜想也有可能是个没法在数论系统中证明的真命题
</pre>
</div>

<div id="outline-container-orgc008120" class="outline-3">
<h3 id="orgc008120">从哥德尔公式到 Y 组合子</h3>
<div class="outline-text-3" id="text-orgc008120">
<p>
哥德尔的不完备性定理证明了 <b>数学是一个未完结的学科</b> ，永远有 <b>需要以人的头脑从系统之外去用独有的直觉发现的东西</b> 
</p>
<pre class="example">
  罗杰・彭罗斯在《The Emperor' s New Mind》中用它来证明人工智能的不可实现

  当然，这个结论是很受质疑的。但哥德尔的不完备性定理的确还有很多很多的有趣推论，数学的和哲学上的
</pre>

<p>
哥德尔的不完备性定理最深刻的地方就是它揭示了 <b>自指（或称 <span class="underline">递归调用自身</span> 等等）结构的普遍存在性</b> ，再来看一看哥德尔命题的绝妙构造：
</p>

<pre class="example">
G(n) : UnPr( N(n) )

</pre>

<p>
注意：这里的 <span class="underline">UnPr</span> 其实是一个 <b>形式化的谓词</b> ，它不一定要说“X在T内可证明”，可以把它 <b>泛化为一个 <span class="underline">一般化</span> 的谓词</b>  <span class="underline">P</span> ：
</p>

<pre class="example">
G(n) : P( N(n) )

</pre>

<p>
对于任意一个单参的谓词P，都存在上面这个哥德尔公式。然后算出这个哥德尔公式的 <span class="underline">自然数编码 g</span> ，然后把它扔给G，就得到：
</p>
<pre class="example">
G(g) : P( G(g) )

</pre>

<p>
<span class="underline">Y 组合子</span> 的构造不就是这样一个形式，把 <span class="underline">G</span> 和 <span class="underline">P</span> 都看成 <b>一元函数</b> ， <span class="underline">G(g)</span> 正是 <span class="underline">P</span> 这个函数的 <b>不动点</b> 么！于是，从哥德尔的证明里面直接看到了Y 组合子！
</p>
</div>
</div>
</div>

<div id="outline-container-org3190152" class="outline-2">
<h2 id="org3190152">对角线方法</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
